---
kind: property
id: P:Autodesk.Revit.DB.BasicFileInfo.IsLocal
source: html/10c8c9c8-b938-981b-c90e-ceae3de832c8.htm
---
# Autodesk.Revit.DB.BasicFileInfo.IsLocal Property

Checks if the file is workshared and Local.

## Syntax (C#)
```csharp
public bool IsLocal { get; }
```